#include"includes.h"
#include "skCrypter.h"


//#define SET_CURRENT_COLOR(is_friendly, i, visible_color,not_visible_color) \
//    ((Settings::client.cg->ClientBits().isVisible(i)) ? \
//        ((is_friendly) ? Settings::Colors::visible_team : visible_color) : \
//        ((is_friendly) ? Settings::Colors::not_visible_team : not_visible_color))


#define SET_CURRENT_COLOR(is_friendly, i, visible_color,not_visible_color) \
    ((Settings::client.cg->ClientBits().isVisible(i)) ? \
        ((is_friendly) ? Settings::Colors::visible_team : visible_color) : \
        ((is_friendly) ? Settings::Colors::not_visible_team : not_visible_color))


bool overridekeyPressed;


ImColor VisCheckEntity(bool isvis, bool isfriendly, ImColor visible_color, ImColor not_visible_color)
{
	return ((isvis) ? ((isfriendly) ? Settings::Colors::visible_team : visible_color) : ((isfriendly) ? Settings::Colors::not_visible_team : not_visible_color));
}

bool isKeyDown(int key) {
	return GetAsyncKeyState(aimbotkey) & 0x8000;
}
bool is_key_active2()
{

	if (Settings::Aimbot::aim_key == 0)
		keyPressed = (isKeyDown(aimbotkey));
	overridekeyPressed = (isKeyDown(overrideaimbotkey));

	if (Settings::Aimbot::aim_key == 1 && isKeyDown(aimbotkey))
		return keyPressed = !keyPressed;
	return overridekeyPressed = !overridekeyPressed;


	return false;

}

namespace visuals
{
	//Draw Real PLayers
	void DrawPlayer(entity_t* ent)
	{
	}
	// Draw Bots
	void DrawAI(entity_t* ai)
	{
		float display_string{};

					game_sdk::draw::draw_sketch_edge_text(g_menu::esp_font, distance_string, pos, 14, Settings::Visuals::show_aim_target && aim_target == ent->nextstate().number ? Settings::Colors::aim_target : ZombieColor, true);

					display_string += 15;
				}


				if (Settings::Visuals::b_showName)
				{

					//std::string teamID = std::to_string(clientinfo->squadIndex);
					//std::string player = clientinfo->name; //nameWithHash //name

					std::string output = XOR("Zombie/AI");
					//std::string test;
					//std::string newtest;

					auto pos = ImVec2(bbox.x + bbox.w * 0.5f, bbox.y - 17);
					game_sdk::draw::draw_sketch_edge_text(g_menu::esp_font, output, pos, 14, Settings::Visuals::show_aim_target && aim_target == ent->nextstate().number ? Settings::Colors::aim_target : ZombieColor, true);





				}
			}
		}

		if (saved > 0 && Settings::Visuals::b_danger)
		{
			if (is_bad_ptr(refdef))return;

			game_sdk::draw::DrawString(XOR("WARNING ") + std::string(std::to_string(saved)) + XOR(" Player Nearby!"), refdef->displayViewport.Width / 2, refdef->displayViewport.Height / 4, 30.f, true, ImColor(255, 0, 0, 255));
			reset_danger = true;
		}

		if (!aimbot::m_best_pos.is_Zero())
		{
			if (math::vec2_t predict_screen; game_sdk::world_to_screen(aimbot::m_best_pos, predict_screen) && Settings::Aimbot::prediction_circle)
			{
				game_sdk::draw::draw_circle(ImVec2(predict_screen.x, predict_screen.y), 6.5f, ImColor(255, 0, 0), 100.0f);
			}
		}
		math::vec2_t bone_screen_pos;
		if (game_sdk::world_to_screen(aimbot::m_best_pos, bone_screen_pos))
		{
			//auto col_hitbone = config::get<t>(Settings::Colors::aimbot_visuals_hitbone_col);
			if (Settings::Aimbot::aimbot_visuals_hitbone)
			{
				ImGui::GetBackgroundDrawList()->AddCircle({ bone_screen_pos.x, bone_screen_pos.y }, 5, ImColor(255, 255, 255), 100);
			}

			if (Settings::Aimbot::aimbot_visuals_snapline)
			{
				ImGui::GetBackgroundDrawList()->AddLine(ImGui::GetIO().DisplaySize / 2, { bone_screen_pos.x, bone_screen_pos.y }, ImColor(255, 255, 255));
			}
		}
	}

	auto get_scriptable_instanceContexts(const uint32_t id) -> game_struct::ScriptableInstanceContextSecure*
	{

		auto addr = (__int64*)((uintptr_t)GetModuleHandleA(0) + Settings::mem.scriptable.ClientContext);
		if (is_valid_ptr(addr))
		{
			auto ret = *addr + (static_cast<uint64_t>(id) * 0x98);

			return (game_struct::ScriptableInstanceContextSecure*)ret;
		}


		return nullptr;
	};

	game_struct::CG_ClientModel_RuntimeData* CG_ClientModel_GetRuntimeData(uint16_t id)
	{
		auto addr = (uintptr_t)((uintptr_t)GetModuleHandleA(0) + Settings::mem.scriptable.CG_ClientModel_RuntimeData.cast());
		auto ret = addr + (id * 0x338);
		return (game_struct::CG_ClientModel_RuntimeData*)ret;

	}


	enum RarityIndex
	{
		grey = 0,
		green = 1,
		blue = 2,
		purple = 3,
		gold = 4,
		custom_loot = 10
	};


	enum LootTypes
	{
		field_upgrade = 18,
		ammo = 1,
		weapon = 2,
		perk = 37,
		token = 15,
		crate = 21,
		plate = 7,
		money = 11,
		explosives = 9,
		tactical = 17,
		gasmask = 5,
		sell_item = 28,
		revivekit = 12,
		fuel = 35,
		contract = 20,
		streaks = 16
	};

	struct BG_SpawnGroup_Loot_ItemDef
	{
		const char* name;
		int8_t type; //0x0008
		char pad_0009[23]; //0x0009
		int8_t rarity; //0x0020
		const char pad_0021[7]; //0x0021
		const char* pickupString; //0x0028
		const char* pickupStringAsset; //0x0030
		const char* weaponFullString; //0x0038
		char pad_0040[128]; //0x0040
		int32_t weaponIndex; //0x00C0
		char pad_00C4[1992]; //0x00C4

	};

	struct loot_definition_t
	{
		const char* internal_name;
		const char* name;
	};

	const loot_definition_t definitions[] = {
		{"loot_gasmask","Gasmask"},
		{"jup_blue:military_loot_crate","Crate"},
		{"red::military_loot_perkpack_01","Perk Package"},
		{"accessory_money_bag_small","Money Bag"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},
		{"box_ v0","Armor Box"},


	};


	void loot()
	{

		//if (!game_sdk::in_game() || !Settings::Loot::b_enable_LootESP)
		//	return;

		//if (!Settings::client.cg)
		//	return;

		//if (!Settings::client.local_entity)
		//	return;

		//uintptr_t ImageBase;
		//ImageBase = (uint64_t)(iat(GetModuleHandleA).get()("cod.exe"));

		//uintptr_t s_CG_ClientModel_RuntimeData = 0xd969e557 + ImageBase; 

		//if (!Settings::Loot::b_enable_LootESP)
